language/onvif/抓包/probe_response

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"  
               xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"  
               xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing"
               xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
	<soap:Header>
		<wsadis:Action>
			http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches
		</wsadis:Action>
		<wsadis:MessageID>
			urn:uuid:ce0f7732-3ed8-4e30-8b59-a0adce401222
		</wsadis:MessageID>
		<wsadis:RelatesTo>
			uuid:4ff48be0-2113-41bf-be5d-e35f26ac2efa
		</wsadis:RelatesTo>
		<wsadis:To>
			http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
		</wsadis:To>
		<d:AppSequence InstanceId="1558502270" MessageNumber="2">
		</d:AppSequence>
	</soap:Header>
	<soap:Body>
		<d:ProbeMatches>
			<d:ProbeMatch>
				<wsadis:EndpointReference>
					<wsadis:Address>
						urn:uuid:HZ-ICP-0000-ce1e41582d0e
					</wsadis:Address>
				</wsadis:EndpointReference>
				<d:Types>
					dn:NetworkVideoTransmitter
				</d:Types>
				<d:Scopes>
					onvif://www.onvif.org/type/video_encoder 
					onvif://www.onvif.org/type/ptz 
					onvif://www.onvif.org/type/audio_encoder 
					onvif://www.onvif.org/type/video_analytics 
					onvif://www.onvif.org/hardware/DFS_ 
					onvif://www.onvif.org/Profile/Streaming 
					onvif://www.onvif.org/location/country/china 
					onvif://www.onvif.org/location/building/headquarter 
					onvif://www.onvif.org/name/DFS_ 
				</d:Scopes>
				<d:XAddrs>
					http://192.168.15.31/onvif/device_service
				</d:XAddrs>
				<d:MetadataVersion>
					1
				</d:MetadataVersion>
			</d:ProbeMatch>
		</d:ProbeMatches>
	</soap:Body>
</soap:Envelope>
